Revit 2027 API
EnergyAnalysisMaterial.Thickness Property
 The thickness of the material, in ft.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Thickness { get; }
Public ReadOnly Property Thickness As Double
	Get
public:
property double Thickness {
	double get ();
}
member Thickness : float with get
Property Value
Double
See Also
Reference
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace